In [7]:
import pandas as pd
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index = ["A", "B", "C"], columns = ["D", "E", "F"])

In [9]:
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [13]:
#Informacion de los datos en el dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int64
 1   E       3 non-null      int64
 2   F       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [15]:
#Dimension del data Frame
df.shape

(3, 3)

In [19]:
#Calculo de estadisticas generales de la tabla
df.describe()

         D    E    F
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [21]:
df.columns

Index(['D', 'E', 'F'], dtype='object')

In [23]:
#Nombre de los renglones
df.index

Index(['A', 'B', 'C'], dtype='object')

In [25]:
#Para agregar un nuevo renglon
df.loc['G'] = [11, 12, 13]
df

    D   E   F
A   1   2   3
B   4   5   6
C   7   8   9
G  11  12  13

In [27]:
# Agregar un nueva Columna
df["H"] = [17, 16, 15, 14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [29]:
#Extracción de columnas en un dataframe
df2 = df [["E", "H"]] #solo se pone el nombre del data frame sin ningun comando
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [31]:
#Para extraer renglones
df3 = df.iloc[0:2] #Extrae los primeros 2 renglones
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

In [33]:
#Cambio del nombre de TODAS las columnas
df.columns = ['Columna1', 'Columna2', 'Columna3', 'Columna4']
df

   Columna1  Columna2  Columna3  Columna4
A         1         2         3        17
B         4         5         6        16
C         7         8         9        15
G        11        12        13        14

In [37]:
#Cambio del nombre de ALGUNAS las columnas
df.rename(columns = {'Columna1':'Column1', 'Columna2':'Column2'}, inplace = True)
df

   Column1  Column2  Columna3  Columna4
A        1        2         3        17
B        4        5         6        16
C        7        8         9        15
G       11       12        13        14

In [39]:
#Cambio del nombre de ALGUNOS renglones
df.rename(index = {'A':'Dato1', 'B':'Dato2'}, inplace = True)
df

       Column1  Column2  Columna3  Columna4
Dato1        1        2         3        17
Dato2        4        5         6        16
C            7        8         9        15
G           11       12        13        14

In [41]:
# Ordenamiento de DataFrames
df4 = df.sort_values("Columna4", ascending = True)
df4

       Column1  Column2  Columna3  Columna4
G           11       12        13        14
C            7        8         9        15
Dato2        4        5         6        16
Dato1        1        2         3        17

In [2]:
import pandas as pd
dfp = pd.DataFrame([['Bella','Labrador','Cafe', 56, 24, '2013-07-01'], ['Charlie','Poodle','Negro', 43, 24, '2016-09-16'], ['Lucy','Chow Chow','Café', 46, 24, '2014-08-35'], ['Cooper','Schnauzer','Gris', 49, 17, '2011-12-11'], ['Bernie','San Bernardo','Blanco', 77, 74, '2018-02-27']], index = [0, 1, 2, 3, 4], columns = ["Nombre", "Raza", "Color", "Altura_CM", "Peso_KG", "Fecha_Nac"])
dfp

    Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
0    Bella      Labrador    Cafe         56       24  2013-07-01
1  Charlie        Poodle   Negro         43       24  2016-09-16
2     Lucy     Chow Chow    Café         46       24  2014-08-35
3   Cooper     Schnauzer    Gris         49       17  2011-12-11
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27

In [15]:
#Para extraer los valores de aquellos perros que nacieron antes del 2015-01-01
dfp2 = dfp[dfp['Fecha_Nac'] < '2015-01-01']
dfp2

   Nombre       Raza Color  Altura_CM  Peso_KG   Fecha_Nac
0   Bella   Labrador  Cafe         56       24  2013-07-01
2    Lucy  Chow Chow  Café         46       24  2014-08-35
3  Cooper  Schnauzer  Gris         49       17  2011-12-11

In [23]:
#Si un campo numerico se tomara como String, se puede hacer el cambio con el siguiente comando:
# dfp['Altura_CM'] = dfp['Altura_CM'].astype(int)
dfp3 = dfp[dfp['Altura_CM'] > 50]
dfp3

   Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac
0   Bella      Labrador    Cafe         56       24  2013-07-01
4  Bernie  San Bernardo  Blanco         77       74  2018-02-27

In [4]:
dfp["IMM"] = dfp['Peso_KG'] / (dfp['Altura_CM'] / 100) ** 2
dfp

    Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac         IMM
0    Bella      Labrador    Cafe         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow Chow    Café         46       24  2014-08-35  113.421550
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

In [6]:
#Ordenar 
dfp

    Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac         IMM
0    Bella      Labrador    Cafe         56       24  2013-07-01   76.530612
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892
2     Lucy     Chow Chow    Café         46       24  2014-08-35  113.421550
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255

In [8]:
dfp = dfp.sort_values("IMM", ascending = True)
dfp

    Nombre          Raza   Color  Altura_CM  Peso_KG   Fecha_Nac         IMM
3   Cooper     Schnauzer    Gris         49       17  2011-12-11   70.803832
0    Bella      Labrador    Cafe         56       24  2013-07-01   76.530612
2     Lucy     Chow Chow    Café         46       24  2014-08-35  113.421550
4   Bernie  San Bernardo  Blanco         77       74  2018-02-27  124.810255
1  Charlie        Poodle   Negro         43       24  2016-09-16  129.799892